micropython/micropython/ports/psoc6/modules/network/network_ifx_wcm.c
    if ((CY_WCM_SCAN_COMPLETE == status)) {
        /* Reset the number of scan results to 0 for the next scan.*/
        num_scan_result = 0;
    }
    return;
}


STATIC mp_obj_t network_ifx_wcm_scan(size_t n_args, const mp_obj_t *args, mp_map_t *kwargs) {
    // const char *band_string[] =
    // {
    //     [CY_WCM_WIFI_BAND_ANY] = "2.4 and 5 GHz",
    //     [CY_WCM_WIFI_BAND_2_4GHZ] = "2.4 GHz",
    //     [CY_WCM_WIFI_BAND_5GHZ] = "5 GHz"
    // };
    // cy_wcm_mac_t scan_for_mac_value = {SCAN_FOR_MAC_ADDRESS};

    network_ifx_wcm_obj_t *self = MP_OBJ_TO_PTR(args[0]);

    cy_rslt_t ret = CY_RSLT_SUCCESS;
    cy_wcm_scan_filter_t scan_filter;
    bool is_filter_used = false;

    if (self->itf != CY_WCM_INTERFACE_TYPE_STA) {
        mp_raise_ValueError(MP_ERROR_TEXT("network STA required"));
    }

    if (n_args != 1) {
        mp_raise_TypeError(MP_ERROR_TEXT("network scan accepts no query parameters"));
    }

    if (kwargs->used != 0) {
        if (kwargs->alloc != 1) {
            mp_raise_TypeError(MP_ERROR_TEXT("network scan only accepts one filter mode"));
        }

        is_filter_used = true;
        mp_map_elem_t *e = &kwargs->table[0];
        switch (mp_obj_str_get_qstr(e->key))
        {
            case MP_QSTR_ssid: {
                scan_filter.mode = CY_WCM_SCAN_FILTER_TYPE_SSID;
                size_t len;
                const char *ssid = mp_obj_str_get_data(e->value, &len);
                len = MIN(len, CY_WCM_MAX_SSID_LEN + 1);
                memcpy(scan_filter.param.SSID, ssid, len);
                memset(&scan_filter.param.SSID[len], 0, 1); // null terminated str.
                break;
            }

            case MP_QSTR_bssid: {
                scan_filter.mode = CY_WCM_SCAN_FILTER_TYPE_MAC;
                mp_buffer_info_t bssid;
                mp_get_buffer(e->value, &bssid, MP_BUFFER_READ);
                if (bssid.len != CY_WCM_MAC_ADDR_LEN) {
                    mp_raise_ValueError(MP_ERROR_TEXT("bssid address invalid length"));
                }
                memcpy(scan_filter.param.BSSID, bssid.buf, bssid.len);
                break;
            }

            case MP_QSTR_band: {
                scan_filter.mode = CY_WCM_SCAN_FILTER_TYPE_BAND;
                break;
            }

            case MP_QSTR_rssi: {
                scan_filter.mode = CY_WCM_SCAN_FILTER_TYPE_RSSI;
                break;
            }

            default:
                mp_raise_ValueError(MP_ERROR_TEXT("unknown config param"));

        }
    }
    // // Extract ssid, if given
    // cy_wcm_ssid_t *ssid_ptr = NULL;
    // cy_wcm_ssid_t ssid;


    // if (args[ARG_ssid].u_obj != mp_const_none) {
    //     ssid_ptr = &ssid;
    //     mp_buffer_info_t ssid_arg;
    //     mp_get_buffer_raise(args[ARG_ssid].u_obj, &ssid_arg, MP_BUFFER_READ);
    //     ssid.length = MIN(ssid_arg.len, SSID_NAME_SIZE);
    //     memcpy(ssid.value, ssid_arg.buf, ssid.length);
    // }

    // // Extract bssid, if given
    // cy_wcm_mac_t *bssid_ptr = NULL;
    // cy_wcm_mac_t bssid;
    // if (args[ARG_bssid].u_obj != mp_const_none) {
    //     bssid_ptr = &bssid;
    //     mp_buffer_info_t bssid_arg;
    //     mp_get_buffer_raise(args[ARG_bssid].u_obj, &bssid_arg, MP_BUFFER_READ);
    //     memcpy(bssid.octet, bssid_arg.buf, 6);
    // }

    // // Extract channel list, if provided
    // uint16_t channel_list[sizeof(uint8_t)] = {0};
    // if (args[ARG_channels].u_obj != mp_const_none) {
    //     mp_buffer_info_t channels_arg;
    //     mp_get_buffer_raise(args[ARG_channels].u_obj, &channels_arg, MP_BUFFER_READ);
    //     memcpy(channel_list, channels_arg.buf, channels_arg.len);
    //     channel_list[channels_arg.len] = 0; // The channel list array needs to be zero terminated.
    // }

    // switch (scan_filter_mode_select)
    // {
    //     case SCAN_FILTER_NONE:
    //         // APP_INFO(("Scanning without any filter\n"));
    //         break;

    //     case SCAN_FILTER_SSID:
    //         APP_INFO(("Scanning for %s.\n", SCAN_FOR_SSID_VALUE));

    //         /* Configure the scan filter for SSID specified by
    //          * SCAN_FOR_SSID_VALUE.
    //          */
    //         scan_filter.mode = CY_WCM_SCAN_FILTER_TYPE_SSID;
    //         memcpy(scan_filter.param.SSID, SCAN_FOR_SSID_VALUE, sizeof(SCAN_FOR_SSID_VALUE));
    //         break;

    //     case SCAN_FILTER_RSSI:
    //         APP_INFO(("Scanning for RSSI > %d dBm.\n", SCAN_FOR_RSSI_VALUE));

    //         /* Configure the scan filter for RSSI range specified by
    //          * SCAN_FOR_RSSI_VALUE.
    //          */
    //         scan_filter.mode = CY_WCM_SCAN_FILTER_TYPE_RSSI;
    //         scan_filter.param.rssi_range = SCAN_FOR_RSSI_VALUE;
    //         break;

    //     case SCAN_FILTER_MAC:
    //         APP_INFO(("Scanning for %02X:%02X:%02X:%02X:%02X:%02X.\n", scan_for_mac_value[0], scan_for_mac_value[1], scan_for_mac_value[2], scan_for_mac_value[3], scan_for_mac_value[4], scan_for_mac_value[5]));

    //         /* Configure the scan filter for MAC specified by scan_for_mac_value
    //          */
    //         scan_filter.mode = CY_WCM_SCAN_FILTER_TYPE_MAC;
    //         memcpy(scan_filter.param.BSSID, &scan_for_mac_value, sizeof(scan_for_mac_value));
    //         break;

    //     case SCAN_FILTER_BAND:
    //         APP_INFO(("Scanning in %s band.\n", band_string[SCAN_FOR_BAND_VALUE]));

    //         /* Configure the scan filter for band specified by
    //          * SCAN_FOR_BAND_VALUE.
    //          */
    //         scan_filter.mode = CY_WCM_SCAN_FILTER_TYPE_BAND;
    //         scan_filter.param.band = SCAN_FOR_BAND_VALUE;
    //         break;

    //     default:
    //         break;
    // }

    mp_obj_t res = mp_obj_new_list(0, NULL);
    // mp_obj_t res = mp_obj_new_list(0, NULL);
    // ntwk_scan_result = MP_OBJ_TO_PTR(res);
    void *ntwk_scan_result = MP_OBJ_TO_PTR(res);
    // mp_obj_t scan_list;

    mp_obj_t scan_list = MP_OBJ_FROM_PTR(ntwk_scan_result);


    cy_wcm_scan_filter_t *scan_filter_ptr = NULL;
    if (is_filter_used) {
        scan_filter_ptr = &scan_filter;
    }

    ret = cy_wcm_start_scan(network_ifx_wcm_scan_cb, (void *)scan_list, scan_filter_ptr);
    wcm_assert_raise("network scan error (with code: %d)", ret);

    /* Wait for scan completion if scan was started successfully. The API
     * cy_wcm_start_scan doesn't wait for scan completion. If it is called
     * again when the scan hasn't completed, the API returns
     * CY_WCM_RESULT_SCAN_IN_PROGRESS.

